In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
from pandas.plotting import register_matplotlib_converters
from pylab import rcParams
sns.set_style("darkgrid")

import warnings
warnings.filterwarnings("ignore")

In [3]:
df = pd.read_csv("cust_dimen.csv")

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1832 entries, 0 to 1831
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Customer_Name     1832 non-null   object
 1   Province          1832 non-null   object
 2   Region            1832 non-null   object
 3   Customer_Segment  1832 non-null   object
 4   Cust_id           1832 non-null   object
dtypes: object(5)
memory usage: 71.7+ KB

In [4]:
df.head()

        Customer_Name Province   Region Customer_Segment Cust_id
0  MUHAMMED MACINTYRE  NUNAVUT  NUNAVUT   SMALL BUSINESS  Cust_1
1        BARRY FRENCH  NUNAVUT  NUNAVUT         CONSUMER  Cust_2
2       CLAY ROZENDAL  NUNAVUT  NUNAVUT        CORPORATE  Cust_3
3      CARLOS SOLTERO  NUNAVUT  NUNAVUT         CONSUMER  Cust_4
4        CARL JACKSON  NUNAVUT  NUNAVUT        CORPORATE  Cust_5

In [ ]:
df1 = pd.read_csv("orders_dimen.csv")

In [14]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5506 entries, 0 to 5505
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order_Date      5506 non-null   object
 1   Order_Priority  5506 non-null   object
 2   Ord_id          5506 non-null   object
dtypes: object(3)
memory usage: 129.2+ KB

In [6]:
df1.head()

   Order_Date Order_Priority Ord_id
0  13-10-2010            LOW  Ord_1
1  01-10-2012           HIGH  Ord_2
2  10-07-2011           HIGH  Ord_3
3  28-08-2010  NOT SPECIFIED  Ord_4
4  17-06-2011           HIGH  Ord_5

In [34]:
df1.loc[df1.Order_Priority=="NOT SPECIFIED"]

      Order_Date Order_Priority    Ord_id
3     28-08-2010  NOT SPECIFIED     Ord_4
8     08-06-2012  NOT SPECIFIED     Ord_9
9     04-08-2012  NOT SPECIFIED    Ord_10
11    25-11-2009  NOT SPECIFIED    Ord_12
14    12-03-2010  NOT SPECIFIED    Ord_15
...          ...            ...       ...
5469  13-09-2010  NOT SPECIFIED  Ord_5470
5472  08-03-2012  NOT SPECIFIED  Ord_5473
5473  09-08-2010  NOT SPECIFIED  Ord_5474
5478  09-01-2012  NOT SPECIFIED  Ord_5479
5501  08-10-2010  NOT SPECIFIED  Ord_5502

[1080 rows x 3 columns]

In [7]:
df2 = pd.read_csv("shipping_dimen.csv")

In [15]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7701 entries, 0 to 7700
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Order_ID   7701 non-null   int64
 1   Ship_Mode  7701 non-null   object
 2   Ship_Date  7701 non-null   object
 3   Ship_id    7701 non-null   object
dtypes: int64(1), object(3)
memory usage: 240.8+ KB

In [8]:
df2.head()

   Order_ID       Ship_Mode   Ship_Date Ship_id
0         3     REGULAR AIR  20-10-2010   SHP_1
1       293  DELIVERY TRUCK  02-10-2012   SHP_2
2       293     REGULAR AIR  03-10-2012   SHP_3
3       483     REGULAR AIR  12-07-2011   SHP_4
4       515     REGULAR AIR  30-08-2010   SHP_5

In [9]:
df3 = pd.read_excel("market_fact.xlsx")

In [16]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8399 entries, 0 to 8398
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Ord_id               8399 non-null   object
 1   Prod_id              8399 non-null   object
 2   Ship_id              8399 non-null   object
 3   Cust_id              8399 non-null   object
 4   Sales                8399 non-null   int64
 5   Discount             8399 non-null   float64
 6   Order_Quantity       8399 non-null   int64
 7   Product_Base_Margin  8336 non-null   float64
dtypes: float64(2), int64(2), object(4)
memory usage: 525.1+ KB

In [10]:
df3.head()

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Product_Base_Margin
0,Ord_1,Prod_1,SHP_1,Cust_1,26154,0.04,6,0.08
1,Ord_10,Prod_3,SHP_13,Cust_10,8061,0.02,15,0.37
2,Ord_100,Prod_8,SHP_138,Cust_58,12112,0.01,3,0.44
3,Ord_1000,Prod_6,SHP_1384,Cust_373,33471,0.01,25,0.38
4,Ord_1001,Prod_5,SHP_1385,Cust_374,198126,0.07,49,0.76

In [11]:
df4 = pd.read_excel("prod_dimen.xlsx")

In [18]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Product_Category      17 non-null     object
 1   Product_Sub_Category  17 non-null     object
 2   Prod_id               17 non-null     object
dtypes: object(3)
memory usage: 536.0+ bytes

In [12]:
df4.head()

  Product_Category            Product_Sub_Category Prod_id
0  OFFICE SUPPLIES          STORAGE & ORGANIZATION  Prod_1
1  OFFICE SUPPLIES                      APPLIANCES  Prod_2
2  OFFICE SUPPLIES  BINDERS AND BINDER ACCESSORIES  Prod_3
3       TECHNOLOGY    TELEPHONES AND COMMUNICATION  Prod_4
4        FURNITURE              OFFICE FURNISHINGS  Prod_5